// src\core\shortestPath.ts
/* 2駅を選択したら、その最短距離を求めるモジュール
- 駅数ではなくdistance(駅間キロ)の合計が最小のルートを選定
- アプリ共通のadjacency_list を使用する
- 引数: 必須駅(駅ID)2つ
- 戻り値: スタート駅ID, ゴール駅ID, 経路に含まれる駅IDの配列(スタート->ゴール順), 総距離(distanceの合計), 乗り換え回数(transferの数)

- type: "transfer"の場合はdistanceを0とする。
- start == end（つまり必須駅が2つとも同じ)場合、ドメイン層ではエラーにする。
- UIでもバリデーションで同じ必須駅は選択できないようにするが、二段構え。
- 経路が見つからなかった場合（ありえないけど）も同様にエラー扱い。
- MVPではヒープを使わないダイクストラ法を採用
*/

type ShortestPathResult = {
    startStationId: string;// "M10"といった文字列を想定するのでString
    endStationId: string;
    stationIdPath: string[];// スタート->ゴールの駅ID配列
    totalDistance: number;
    transferCount: number;
};


/*
    1. スタート駅ID(startId) == ゴール駅Id(endId)ならエラーを返す
    2. adjacency_listから接続している駅・乗り換えとdistanceを取得する
    3. ダイクストラ法の入れ物3つ(各駅のスタート駅からの暫定距離表、各駅のひとつ前のidを覚えておく表、未確定の駅の集合)を用意、初期化
    - 各駅のスタート駅からの暫定距離表: 「駅ID（文字列）をキーにして、“スタートからの距離（数値）”を入れる表」
    - 各駅のひとつ前のidを覚えておく表: 「駅ID（文字列）をキーにして、“ひとつ前の駅ID（または null）”を入れる表」
    - 未確定駅の集合: 「まだ確定してない駅IDだけを集めた箱（最初は全駅IDが入っている）」
    4. 未確定駅が残っている間に下記を繰り返す
    4.1. 未確定駅の集合から、スタート駅からの暫定距離が最小の駅を選ぶ(その駅がゴール駅なら、ゴールして終了)
    4.2. その駅から伸びている辺について、隣の駅への新しい距離候補を計算する。現在の駅までの距離+ walk_line のdistance。(type: transferの場合はdistance=0扱い)
    - この段階で乗り換え回数はカウントしない
    4.3. もし計算した距離候補のほうが既存の隣駅の暫定距離表より小さければ、
    - 隣駅の暫定距離表を更新
    - 隣駅の"前の駅"をいまの駅に更新
    4.4. いまの駅を「確定済」にして未確定駅の集合から除外する
    5. 探索終了後
    - ゴール駅の距離がとても大きい値(∞)のままならエラー返す
    - そうでなければ、「前の駅表」をゴールからスタートまで辿って最短距離ルートを復元する
        - ゴール->スタートに並べる
        - スタート->ゴールの順番に並べなおす
        - 並べ替えた配列について、adjacency_listと照らし合わせて乗り換え回数をカウントする
    - 「スタート駅ID」「ゴール駅ID」「最短距離駅ID配列」「総距離」「乗り換え回数(transferCount)」を返す
*/

export const findShortestPath = (startStationId: number, endStationId: number): ShortestPathResult => {

};